src/cf/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПокупатели</name>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СерииНоменклатуры/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ДатаПоступления = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Номер декларации и страна скрыты функциональной опцией «Импорт»: при выключенной опции поле с
	// ошибкой пользователь не увидит, а серию с декларацией из перенесённых данных не записать.
	Если ЗначениеЗаполнено(НомерГТД) И ПолучитьФункциональнуюОпцию("ИспользоватьИмпорт") Тогда
		ПроверяемыеРеквизиты.Добавить("СтранаПроисхождения");
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Адресная = ТЧПокупатели.Количество()>0;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ШК = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШК(Ссылка.Владелец,,Ссылка);
	Если ШК = "" Тогда
		ЗанятьНовыйШтрихкод();
	КонецЕсли;
КонецПроцедуры

// Сгенерированный EAN-13 мог успеть занять другой сеанс: тогда номер генерируется заново, чужой штрихкод не
// перезаписывается (РегистрыСведений.ШтрихкодыНоменклатуры.ЗанятьШтрихкод).
//
Процедура ЗанятьНовыйШтрихкод()

	// BSLLS:MagicNumber-off
	Попыток = 10;
	// BSLLS:MagicNumber-on
	ТекстОтказа = "";
	Для НомерПопытки = 1 По Попыток Цикл
		НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьEAN13();
		ТекстОтказа = РегистрыСведений.ШтрихкодыНоменклатуры.ЗанятьШтрихкод(НовыйШтрихкод, Владелец, Ссылка);
		Если ТекстОтказа = "" Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ВызватьИсключение ТекстОтказа;

КонецПроцедуры
